// *++
//
// Copyright (c) 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   DateStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell date command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"
#langdef   fra "Français"

#string STR_DATE_PRINTDATE             #language eng  "%02d/%02d/%04d\n"

#string STR_DATE_CLOCK_NOT_FUNC        #language eng  "%Hdate%N: Clock not functional\n"

#string STR_DATE_LINE_HELP             #language eng  "Displays the current date or sets the date in the system"

#string STR_DATE_VERBOSE_HELP          #language eng  "Displays the current date or sets the date in the system.\n"  
                                                      "\n"
                                                      "DATE [mm/dd/[yy]yy]\n" 
                                                      "\n"
                                                      "    mm    - Month of date to be set, Month range: 1 - 12\n"
                                                      "    dd    - Day of date to be set, Day range: 1 - 31\n"
                                                      "    yyyy  - Year of date to be set, Year range: 1998 - 2099\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. yy: 98=1998, 99=1999, 00=2000, 01=2001, ..., 97=2097.\n"
                                                      "    2. yyyy: 1998 - 2099, other values are invalid.\n"
                                                      "    3. EFI may behave unpredictably if illegal date values are used.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To display the current date in the system:\n"
                                                      "    fs0:\\> date\n"
                                                      "    06/18/2001\n"
                                                      "\n"
                                                      "  * To set the date with long year format:\n"
                                                      "    fs0:\\> date 01/01/2050\n"
                                                      "    fs0:\\> date\n"
                                                      "    01/01/2050\n"
                                                      "\n"
                                                      "  * To set the date with short year format:\n"
                                                      "    fs0:\\> date 06/18/01\n"
                                                      "    fs0:\\> date\n"
                                                      "    06/18/2001\n"                                                      
